**`commonimages/base/windows_2012_r2_SQL_2014`** terragrunt plan on `pull_request` event [#395](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_ami.parent[0]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 1s [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be created
  + resource "aws_imagebuilder_distribution_configuration" "this" {
      + arn          = (known after apply)
      + date_created = (known after apply)
      + date_updated = (known after apply)
      + description  = "Windows Server 2012 R2 with SQL 2014 Standard"
      + id           = (known after apply)
      + name         = "base_windows_server_2012_r2_SQL_2014_standard"
      + tags         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "n/a"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard"
          + "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard"
        }
      + tags_all     = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "n/a"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard"
          + "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard"
        }

      + distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "Windows Server 2012 R2 with SQL 2014 Standard"
      + distribution_configuration_arn   = (known after apply)
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = (known after apply)
      + name                             = "base_windows_server_2012_r2_SQL_2014_standard"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "n/a"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard"
          + "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard"
        }
      + tags_all                         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "n/a"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard"
          + "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 1 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this will be created
  + resource "aws_imagebuilder_image_recipe" "this" {
      + arn              = (known after apply)
      + date_created     = (known after apply)
      + description      = "Windows Server 2012 R2 with SQL 2014 Standard"
      + id               = (known after apply)
      + name             = "base_windows_server_2012_r2_SQL_2014_standard"
      + owner            = (known after apply)
      + parent_image     = "ami-041565876be3c11cf"
      + platform         = (known after apply)
      + tags             = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "n/a"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard"
          + "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard"
        }
      + tags_all         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "n/a"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard"
          + "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard"
        }
      + user_data_base64 = (known after apply)
      + version          = "0.0.1"

      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 128
              + volume_type           = "gp3"
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }

      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/amazon-cloudwatch-agent-windows/x.x.x"
        }
      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/powershell-core/0.3.0"
        }
      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/aws-cli/0.0.3"
        }
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this will be created
  + resource "aws_imagebuilder_infrastructure_configuration" "this" {
      + arn                           = (known after apply)
      + date_created                  = (known after apply)
      + date_updated                  = (known after apply)
      + description                   = "Windows Server 2012 R2 with SQL 2014 Standard"
      + id                            = (known after apply)
      + instance_profile_name         = "ImageBuilder"
      + instance_types                = [
          + "t3.xlarge",
        ]
      + name                          = "base_windows_server_2012_r2_SQL_2014_standard_0_0_1"
      + resource_tags                 = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "n/a"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard"
          + "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard"
        }
      + security_group_ids            = [
          + "sg-0ee607811d7668f33",
          + "sg-0ffaf9373765d21e9",
        ]
      + subnet_id                     = "subnet-014d083e052388b2a"
      + tags                          = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "n/a"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard"
          + "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard"
        }
      + tags_all                      = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "n/a"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "image-pipeline"                          = "base_windows_server_2012_r2_SQL_2014_standard"
          + "image-recipe"                            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "infrastructure-configuration"            = "base_windows_server_2012_r2_SQL_2014_standard/0.0.1"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2012 r2 with SQL 2014 Standard"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2_SQL_2014_standard"
        }
      + terminate_instance_on_failure = true

      + logging {
          + s3_logs {
              + s3_bucket_name = "ec2-image-builder-logs-20211019134837153100000001"
              + s3_key_prefix  = "base"
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```
